[
  {
    "title": "IT- Full Stack Development",
    "company": "Associated Tea & Agro Management Services Pvt. Ltd.",
    "location": "Guwahati, Assam",
    "salary": "₹ 6,00,000 / year",
    "posted": "2 days ago",
    "description": "looking for a Full Stack Developer Trainee with strong problem-solving and analytical skills, capable of not just maintaining existing systems but reengineering them for scalability and performance.",
    "requirements": ["Python", "FastAPI", "React", "REST APIs"],
    "apply_link": "https://www.linkedin.com/jobs/view/4321993568/?trk=li_li-JobRapido-IN_IN_careers_jobsgtm_d75534d0-39ad-4328-8e18-52229fb7e6b2_job-dist&utm_medium=jobdist&mcid=6853763504395177984&utm_source=li-JobRapido-IN&ePP=CwEAAAGadigv5ukqtf-TkSRyCGYp5G71ezGaOv_J8IubWaYi_Gy242SJullEYcZ73HluF6p4SU2R9cCkIYrTu2Zds7cwwNrptDgE3N2l-g&ccuid=66828429921"
  },
  {
    "title": "Data Center Program Manager, IT/Network",
    "company": "Microsoft",
    "location": "ayetteville, Georgia, United States",
    "salary": "₹ 5,00,000 / year",
    "posted": "1 week ago",
    "description": "Microsoft’s Cloud Operations & Innovation (CO+I) is the engine that powers our cloud services. As a CO+I Data Center Project Manager, IT/Network.",
    "requirements": ["SQL", "Pandas", "Excel", "PowerBI"],
    "apply_link": "https://jobs.careers.microsoft.com/global/en/job/1855390/Data-Center-Program-Manager%2C-IT%2FNetwork"
  },
  {
    "title": "Software Engineer II (Full stack)",
    "company": "Microsoft",
    "location": "Bangalore, Karnataka",
    "salary": "₹ 7,50,000 / year",
    "posted": "3 days ago",
    "description": "Our team builds this platform using cutting-edge AI and large-scale data systems to surface actionable insights from collaboration and business signals. We’re hiring a Backend Software Engineer II to help deliver intuitive, AI-powered experiences that enable customers to understand work patterns, optimize collaboration, and realize potential by unlocking the full value of Microsoft Copilot. We also use generative AI extensively in our own development process to move fast, learn continuously, and deliver customer value at scale.",
    "requirements": ["React", "JavaScript", "HTML", "CSS", "REST APIs"],
    "apply_link": "https://jobs.careers.microsoft.com/global/en/job/1884923/Software-Engineer-II-(Full-stack)"
  },
  {
    "title": "Application Developer-Cloud FullStack",
    "company": "IBM",
    "location": "Pune, Maharashtra, India",
    "salary": "₹ 12,00,000 / year",
    "posted": "1 day ago",
    "description": "Developer leads the cloud application development/deployment for client based on AWS development methodology, tools and best practices. A developer responsibility is to lead the execution of a project by working with a senior level resource on assigned development/deployment activities and design, build, and maintain cloud environments focusing on uptime, access, control, and network security using automation and configuration management tools",
    "requirements": ["Java, Spring Framework, Spring boot, RESTful APIs. "],
    "apply_link": "https://ibmglobal.avature.net/en_US/careers/JobDetail?jobId=36993&source=WEB_Search_INDIA"
  },
  {
    "title": "Staff Engineer, Cloud Platform Services",
    "company": "IBM",
    "location": "San Jose, Austin, San Francisco, Cambridge, New York, Texas, New York, Massachusetts, California, United States",
    "salary": "₹ 8,00,000 / year",
    "posted": "4 days ago",
    "description": "This role is one of a team of senior engineers leading across our Cloud Platform Services teams at HashiCorp. From Core Platform & Visibility to Identity/IAM and cloud-based Billing services, Cloud Platform Services (CPS) is responsible for delivering the PAAS backbone of the HashiCorp Cloud Platform (HCP).",
    "requirements": ["10+ years of experience in software engineering with experience with large-scale cloud solutions (AWS, Azure, GCP), including CICD-driven software development, testing and release management."],
    "apply_link": "https://ibmglobal.avature.net/en_US/careers/JobDetail?jobId=53267&source=WEB_Search_INDIA"
  },
  {
    "title": "Data Engineer - Lifecycle Innovation & Optimization (LIO)",
    "company": "Cisco",
    "location": "HYDERABAD, Telangana, India",
    "salary": "₹ 10,00,000 / year",
    "posted": "6 days ago",
    "description": "In this role, you will build scalable data solutions, integrating diverse datasets for actionable insights. Your role involves transforming raw data, designing efficient models, and optimizing performance. Ensuring data quality and integrity, you'll collaborate with teams to meet analytical needs.",
    "requirements": ["Proficiency in Snowflake, Google Cloud Platform (GCP), Astra DB (Cassandra), Elasticsearch, Apache Spark (Java), API development (Spring Boot, REST APIs), and related tools."],
    "apply_link": "https://careers.cisco.com/global/en/job/1450257/Data-Engineer-Lifecycle-Innovation-Optimization-LIO"
  },
  {
    "title": "Hardware Engineer, Sydney",
    "company": "ARISTA",
    "location": "Sydney NSW, Australia",
    "salary": "₹ 7,00,000 / year",
    "posted": "2 weeks ago",
    "description": "Our Hardware Design Engineering team is at the forefront of developing high-speed networking and Ethernet products used in Enterprise campuses, hyperscale datacenters and bleeding edge AI clusters. The team is responsible for the end-to-end design and development of advanced hardware solutions that meet the demands of modern networking environments.",
    "requirements": ["Authoring Functional Specifications of high power and high density Ethernet switches, Bachelor of Engineering (Electrical, Electronics, Computer) "],
    "apply_link": "https://www.smartrecruiters.com/AristaNetworks/744000092650667-hardware-engineer-sydney"
  },
  {
    "title": "DSoftware Engineer III, Google Cloud",
    "company": "Google",
    "location": "Bengaluru, Karnataka, India",
    "salary": "₹ 9,00,000 / year",
    "posted": "5 days ago",
    "description": "The AI and Infrastructure team works on the world’s toughest problems, redefining what’s possible and the possible easy. We empower Google customers by delivering AI and Infrastructure at unparalleled scale, efficiency, reliability and velocity. Our customers include Googlers, Googler Cloud customers, and billions of Google users worldwide. We’re at the center of amazing work at Google by being the “flywheel” that enables our advanced AI models, delivers computing power across global services, and offers platforms that developers use to build services.",
    "requirements": ["2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.", "Security"],
    "apply_link": "https://www.google.com/about/careers/applications/jobs/results/74939955737961158-software-engineer-iii-google-cloud"
  },
  {
    "title": "Staff UX Researcher, Search",
    "company": "Google",
    "location": "New York, NY, USA",
    "salary": "₹ 8,50,000 / year",
    "posted": "1 week ago",
    "description": "As a User Experience Researcher (UXR), you’ll help your team of UXers, product managers, and engineers understand user needs. You’ll work with stakeholders across functions and levels and have impact at all stages of product development. You’ll play a critical role in creating useful, usable, and delightful products. You’ll explore user behaviors and motivations by conducting primary research such as field studies, interviews, diary studies, participatory workshops, ethnography, surveys, usability testing, and logs analysis.",
    "requirements": ["7 years of experience working with executive leadership (e.g., Director level),Master's degree or PhD in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field."],
    "apply_link": "https://www.google.com/about/careers/applications/jobs/results/137013285927953094-staff-ux-researcher-search"
  },
  {
    "title": "Senior Software Engineer, Android ML Services",
    "company": "Google",
    "location": "Kraków, Poland",
    "salary": "₹ 9,50,000 / year",
    "posted": "3 days ago",
    "description": "Android is Google’s mobile operating system powering more than 3 billion devices worldwide. Android is about bringing computing to everyone in the world. We believe computing is a super power for good, enabling access to information, economic opportunity, productivity, connectivity between friends and family and more. We think everyone in the world should have access to the best computing has to offer. We provide the platform for original equipment manufacturers (OEMs) and developers to build compelling computing devices (smartphones, tablets, TVs, wearables, etc) that run the best apps/services for everyone in the world.",
    "requirements": ["Experience with machine learning or artificial intelligence concepts or technology, Experience in developing, launching products, or technologies with Large Language Models (LLMs)."],
    "apply_link": "https://www.google.com/about/careers/applications/jobs/results/110811477161452230-senior-software-engineer-android-ml-services"
  }
]
